In [1]:
import numpy as np
import pandas as pd

In [2]:
data={"Country":["Spain","Spain","France","France","Belgium","Belgium"],"Players":["Ramos","De Gea","Kante","Pogba","Hazard","Mertens"],"Year":[1994,1998,2002,2004,2014,2006]}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

   Country  Players  Year
0    Spain    Ramos  1994
1    Spain   De Gea  1998
2   France    Kante  2002
3   France    Pogba  2004
4  Belgium   Hazard  2014
5  Belgium  Mertens  2006

In [5]:
df.groupby("Country").mean()

         Year
Country
Belgium  2010
France   2003
Spain    1996

In [7]:
df.groupby("Country").sum().loc["France"]

Year    4006
Name: France, dtype: int64

In [8]:
df.groupby("Country").count()

         Players  Year
Country
Belgium        2     2
France         2     2
Spain          2     2

In [10]:
df.groupby("Country").describe()

         Year
        count    mean       std     min     25%     50%     75%     max
Country
Belgium   2.0  2010.0  5.656854  2006.0  2008.0  2010.0  2012.0  2014.0
France    2.0  2003.0  1.414214  2002.0  2002.5  2003.0  2003.5  2004.0
Spain     2.0  1996.0  2.828427  1994.0  1995.0  1996.0  1997.0  1998.0